; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v1 ?v9)
             (pred_1 ?v8 ?v2)
             (pred_12 ?v1 ?v2)
             (pred_6 ?v13 ?v1 )
	     (pred_9 ?v1)
             (pred_4 ?v10)
             (pred_10 ?v8)
             (pred_8 ?v2)
             (pred_2 ?v1)
             (pred_7 ?v8)
             (pred_11 ?v1)
             (pred_3 ))



(:action op_3
:parameters (?v7 ?v3 ?v5 ?v4)
:precondition (and (pred_4 ?v7) (pred_4 ?v3) (pred_10 ?v5) (pred_8 ?v4)
          (pred_5 ?v7 ?v3) (pred_1 ?v5 ?v4)
                   (pred_12 ?v3 ?v4) (pred_9 ?v7) 
                   (pred_2 ?v3) (pred_7 ?v5))
:effect (and  (pred_11 ?v3) (not (pred_2 ?v3))))


(:action op_4
:parameters (?v7 ?v11)
:precondition (and (pred_4 ?v7) (pred_4 ?v11)
               (pred_9 ?v7) (pred_5 ?v7 ?v11) (pred_11 ?v11))
:effect (and (pred_9 ?v11) (not (pred_9 ?v7))))

(:action op_1
:parameters (?v7 ?v5)
:precondition (and (pred_4 ?v7) (pred_10 ?v5) 
                  (pred_9 ?v7) (pred_6 ?v5 ?v7) (pred_3 ))
:effect (and (pred_7 ?v5)
   (not (pred_6 ?v5 ?v7)) (not (pred_3 ))))


(:action op_5
:parameters (?v7 ?v6 ?v12)
:precondition (and (pred_4 ?v7) (pred_10 ?v6) (pred_10 ?v12)
                  (pred_9 ?v7) (pred_7 ?v12) (pred_6 ?v6 ?v7))
:effect (and (pred_7 ?v6) (pred_6 ?v12 ?v7)
        (not (pred_7 ?v12)) (not (pred_6 ?v6 ?v7))))

(:action op_2
:parameters (?v7 ?v5)
:precondition (and (pred_4 ?v7) (pred_10 ?v5) 
                  (pred_9 ?v7) (pred_7 ?v5))
:effect (and (pred_3 ) (pred_6 ?v5 ?v7) (not (pred_7 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_01 obj_05 obj_07 obj_13 obj_19 obj_16 obj_22 obj_14 obj_03 obj_15 obj_21 obj_02 obj_10 obj_08 obj_18
    obj_09 obj_04 obj_17
    obj_12 obj_20 obj_06
    )

    (:init
       (pred_3)

       (pred_4 obj_11)
       (pred_4 obj_01)
       (pred_4 obj_05)
       (pred_4 obj_07)
       (pred_4 obj_13)
       (pred_4 obj_19)
       (pred_4 obj_16)
       (pred_4 obj_22)
       (pred_4 obj_14)
       (pred_4 obj_03)
       (pred_4 obj_15)
       (pred_4 obj_21)
       (pred_4 obj_02)
       (pred_4 obj_10)
       (pred_4 obj_08)
       (pred_4 obj_18)
       (pred_8 obj_09)
       (pred_8 obj_04)
       (pred_8 obj_17)
       (pred_10 obj_12)
       (pred_10 obj_20)
       (pred_10 obj_06)

       (pred_5 obj_11 obj_13)
       (pred_5 obj_11 obj_01)
       (pred_5 obj_01 obj_19)
       (pred_5 obj_01 obj_05)
       (pred_5 obj_01 obj_11)
       (pred_5 obj_05 obj_16)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_05 obj_01)
       (pred_5 obj_07 obj_22)
       (pred_5 obj_07 obj_05)
       (pred_5 obj_13 obj_14)
       (pred_5 obj_13 obj_19)
       (pred_5 obj_13 obj_11)
       (pred_5 obj_19 obj_03)
       (pred_5 obj_19 obj_16)
       (pred_5 obj_19 obj_01)
       (pred_5 obj_19 obj_13)
       (pred_5 obj_16 obj_15)
       (pred_5 obj_16 obj_22)
       (pred_5 obj_16 obj_05)
       (pred_5 obj_16 obj_19)
       (pred_5 obj_22 obj_21)
       (pred_5 obj_22 obj_07)
       (pred_5 obj_22 obj_16)
       (pred_5 obj_14 obj_02)
       (pred_5 obj_14 obj_03)
       (pred_5 obj_14 obj_13)
       (pred_5 obj_03 obj_10)
       (pred_5 obj_03 obj_15)
       (pred_5 obj_03 obj_19)
       (pred_5 obj_03 obj_14)
       (pred_5 obj_15 obj_08)
       (pred_5 obj_15 obj_21)
       (pred_5 obj_15 obj_16)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_21 obj_18)
       (pred_5 obj_21 obj_22)
       (pred_5 obj_21 obj_15)
       (pred_5 obj_02 obj_10)
       (pred_5 obj_02 obj_14)
       (pred_5 obj_10 obj_08)
       (pred_5 obj_10 obj_03)
       (pred_5 obj_10 obj_02)
       (pred_5 obj_08 obj_18)
       (pred_5 obj_08 obj_15)
       (pred_5 obj_08 obj_10)
       (pred_5 obj_18 obj_21)
       (pred_5 obj_18 obj_08)
       (pred_2 obj_02)
       (pred_2 obj_16)
       (pred_2 obj_08)
       (pred_12  obj_02 obj_09)
       (pred_12  obj_16 obj_04)
       (pred_12  obj_08 obj_17)
       (pred_11 obj_11)
       (pred_11 obj_01)
       (pred_11 obj_05)
       (pred_11 obj_07)
       (pred_11 obj_13)
       (pred_11 obj_19)
       (pred_11 obj_22)
       (pred_11 obj_14)
       (pred_11 obj_03)
       (pred_11 obj_15)
       (pred_11 obj_21)
       (pred_11 obj_10)
       (pred_11 obj_18)

       (pred_1  obj_12 obj_09)
       (pred_1  obj_20 obj_04)
       (pred_1  obj_06 obj_17)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_20 obj_02)
       (pred_6 obj_06 obj_22)
       (pred_9 obj_15)
    )

    (:goal (and
       (pred_6 obj_06 obj_01)
    ))
(:constraints
  (always (not (pred_9 obj_21)))
)
)

; plan
1. (op_4 obj_15 obj_03)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_03)
   goals met: 0 of 1
2. (op_4 obj_03 obj_19)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_19)
   goals met: 0 of 1
3. (op_4 obj_19 obj_01)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_01)
   goals met: 0 of 1
4. (op_4 obj_01 obj_05)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_05)
   goals met: 0 of 1
5. (op_4 obj_05 obj_07)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_07)
   goals met: 0 of 1
6. (op_4 obj_07 obj_22)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_22)
   goals met: 0 of 1
7. (op_1 obj_22 obj_06)
   deleted: (pred_6 obj_06 obj_22) (pred_3)
   added: (pred_7 obj_06)
   goals met: 0 of 1
8. (op_4 obj_22 obj_07)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_07)
   goals met: 0 of 1
9. (op_4 obj_07 obj_05)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_05)
   goals met: 0 of 1
10. (op_4 obj_05 obj_01)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_01)
   goals met: 0 of 1
11. (op_2 obj_01 obj_06)
   deleted: (pred_7 obj_06)
   added: (pred_3) (pred_6 obj_06 obj_01)
   goals met: 1 of 1
